name: Shadow Credentials Added to Account (Alternative)
id: 0xFF-0297-Shadow_Credentials_Added_to_Account_Alternative-Win
tags:
  - ActiveDirectory
  - SuspiciousBehavior
os_family:
  - WindowsEndpoint
  - WindowsServer
fp_rate: Low
severity: Medium
attack:
  - {tactic: 'TA0004', technique: T1484}
  - {tactic: 'TA0003', technique: T1098}
data_sources:
  - provider: SecurityEvents
    event_id: '4662'
    table_name: SecurityEvent
    attack_data_source: Active Directory
    attack_data_component: Active Directory Object Modification
permission_required: Administrator
technical_description: >
  This query searches for modifications to the 'msDS-KeyCredentialLink' property in Active Directory.
  There are two different events which contain information to detect such changes: 5136 and 4662. This detection uses the
  4662, which is an alternative if 5136 is not available.
description: >
  Windows Hello for Business (WHfB) supports multi-factor passwordless authentication. When the user or computer enrolls, the TPM generates a public-private key pair
  for the relevant account. The public key is stored in a new Key Credential object in the msDS-KeyCredentialLink attribute of the account. When a client logs in, Windows
  attempts to perform PKINIT authentication using their private key. Under the Key Trust model, the Domain Controller can decrypt their pre-authentication data using the
  raw public key in the corresponding NGC object stored in the client's msDS-KeyCredentialLink attribute.
  Attackers can abuse this property to gain local administrator access to a computer. Various attack tools such as Whisker,
  DSInternals and ntlmrelayx include functionality to modify this property.
considerations: |
  This query requires event 4662 (Active Directory object operations) to be logged. This attack can also be detected with event 5136, which
  is the preferred option. Detecting this attack with event 4662 is a backup strategy in case 5136 is not available in your environment.
false_positives: >
  The property can also be used for legitimate purposes. However, the legitimate use of the property is limited in most environments.
blindspots: >
  Accounts changing their own 'msDS-KeyCredentialLink' property are excluded from this detection rule, since this behavior periodically
  happens for legitimate purposes, e.g., when updating Windows Hello for Business [WHfB] certificates. As a result, abusing this issue with
  an NTLM relay attack would not trigger this rule.
response_plan: >
  Investigate the source of the update to the 'msDS-KeyCredentialLink' property.
references:
  - https://docs.microsoft.com/en-us/defender-for-identity/configure-windows-event-collection
  - https://docs.microsoft.com/en-us/windows/security/threat-protection/auditing/event-4662
  - https://posts.specterops.io/shadow-credentials-abusing-key-trust-account-mapping-for-takeover-8ee1a53566ab
  - https://github.com/ShutdownRepo/pywhisker
  - https://github.com/MichaelGrafnetter/DSInternals
change_log:
  - {version: '1.0', date: '2022-06-17', impact: major, message: Initial version.}
detection_query:
  language: Kusto
  platform: Sentinel
  deployment_variables:
    query_frequency: PT1H
    entity_mapping:
      - Host:
          FullName: Computer
      - Account:
          FullName: Account
  query: |
    let timeframe = 2*1h;
    SecurityEvent
    | where ingestion_time() >= ago(timeframe)
    | where EventID == 4662
    | where Properties has "5b47d60f-6090-40b2-9f37-2a4de88f3063" // msDS-KeyCredentialLink.
    | where Properties has "%%7685" // "Write Property": https://gist.github.com/brianreitz/d5b9397a2e8b3d52ceb9359897e07c3f.
    // Begin client-specific filter.
    // End client-specific filter.