name: Password Assigned to Existing AWS IAM User
id: 0xFF-0237-Password_Assigned_to_Existing_IAM_User-AWS
tags:
  - AWS
  - SuspiciousBehavior
os_family:
  - N/A
fp_rate: Low
severity: Medium
attack:
  - {tactic: 'TA0003', technique: T1098, sub_technique: "001"}
data_sources:
  - provider: AWS
    event_id: CreateLoginProfile
    table_name: AWSCloudTrail
    attack_data_source: User Account
    attack_data_component: User Account Modification
permission_required: User
technical_description: >
  This query searches for the `CreateLoginProfile` event which assigns a console password to an existing AWS IAM user.
description: >
  When an attacker gains access to an account with high privileges in AWS, they might abuse that to set a password for an existing IAM user
  so that user account can be used to gain access to the AWS web console.
considerations: >
  None.
false_positives: >
  There might be a business reason for assigning a console password to an existing user.
blindspots: >
  None known.
response_plan: >
  Confirm if the user responsible for the setting the console password has done so for a valid business reason.
references:
  - https://github.com/DataDog/stratus-red-team
  - https://docs.aws.amazon.com/IAM/latest/APIReference/API_CreateLoginProfile.html
change_log:
  - {version: '1.2', date: '2022-08-31', impact: minor, message: Entity mapping added.}
  - {version: '1.1', date: '2022-02-22', impact: minor, message: 'Use ingestion_time for event selection and include de-duplication logic.' }
  - {version: '1.0', date: '2022-02-01', impact: major, message: Initial version.}
detection_query:
  language: Kusto
  platform: Sentinel
  deployment_variables:
    query_frequency: PT1H
    query_period: PT2H
    entity_mapping:
      - Account:
          Name: UserAccount
  query: |
    let timeframe = 2*1h;
    AWSCloudTrail
    | where ingestion_time() >= ago(timeframe)
    | where EventName == "CreateLoginProfile"
    // Begin client-specific filter.
    // End client-specific filter.
    | extend UserAccount=tostring(split(UserIdentityArn, "/")[-1])